app/views/portfolios/_form.html.erb

    <%= f.label :company_id %>
    <%= f.select :company_id, Company.pluck(:name, :id), :include_blank => true %> <!-- provides a selection of Companies that can be linked to the portfolio being created -->
---
SELECT "companies"."name", "companies"."id" FROM "companies"