app/controllers/companies_controller.rb

  def index
    @companies = Company.order(sort_column + ' ' + sort_direction)
---
SELECT "companies".* FROM "companies" ORDER BY changepercentage desc

  def result
      symbol = params[:symbol]
      # find info with search parameters

      url = "https://api.iextrading.com/1.0/stock/#{symbol}/quote"
      data = JSON.parse(open(url).read)
        @name = data["companyName"]
        @symbol = data["symbol"]
        @price = data["latestPrice"]
        @change = data["change"]
        @changepercentage = data["changePercent"] * 100
        @marketcap = data["marketCap"]
        @high = data["week52High"]
        @low = data["week52Low"]
        @ytd = data["ytdChange"] * 100
        @exchange = data["primaryExchange"]
      # return companies
      list = Company.where("companyName" => @name)
        # redirect them to the show page for that company so they can add that company to the database from there
          @company = Company.create(:name => @name, :symbol => @symbol, :price => @price, :change => @change, :changepercentage => @changepercentage, :marketcap => @marketcap, :high => @high, :low => @low, :ytd => @ytd,
            :exchange => @exchange)
---
INSERT INTO "companies" ("name", "symbol", "price", "change", "changepercentage", "marketcap", "high", "low", "ytd", "sector", "exchange", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def destroy
      @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 10]]