app/controllers/exchanges_controller.rb

  def index
    @exchanges = Exchange.all
---
SELECT "exchanges".* FROM "exchanges"