app/controllers/portfolios_controller.rb

  def index
    @portfolios = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"