app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jamie@jamie.com"], ["LIMIT", 1]]
---
  def create # Start the User Session upon login
    @user = User.find_by :email => params[:email] # Find the user based on the email input, set up to find by email instead of user id