app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save # If we are successful in saving the user,
      redirect_to root_path # Sends user back to the homepage once the signup is completed successfully